app/views/sessions/profile.html.erb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
<h2>Bienvenue <%= Author.find_by(id: session[:user_id]).name %> !</h2>