app/views/gossips/index.html.erb


<% Gossip.all.each do |potin| %>
---
SELECT "gossips".* FROM "gossips"