app/views/gossips/index.html.erb

SELECT "gossips".* FROM "gossips"
---

<% Gossip.all.each do |potin| %>