app/helpers/sessions_helper.rb

  def current_user
    Author.find_by(id: session[:user_id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]