app/controllers/gossips_controller.rb

SELECT "gossips"."id" FROM "gossips"
---
  def index
    @gossips = Gossip.all

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
INSERT INTO "authors" ("name", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "anon"], ["created_at", "2019-10-31 10:00:23.251553"], ["updated_at", "2019-10-31 10:00:23.251553"], ["password_digest", "$2a$12$LcwaE7IP.55916EuoDGvTuAn9WYv/nTRqn3zVKFT9uUXa4WVYKnzO"]]
INSERT INTO "gossips" ("title", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "encore"], ["content", "un teste."], ["author_id", 3], ["created_at", "2019-10-30 12:29:20.431503"], ["updated_at", "2019-10-30 12:29:20.431503"]]
---
  def create
    @author = Author.find(session[:user_id])
    @gossip = Gossip.new(author: @author, title: params[:title], content: params[:content])

    if @gossip.save

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["title", "je modifie"], ["content", "mon art\r\nicle"], ["updated_at", "2019-10-30 15:17:13.448092"], ["id", 1]]
---
  def update
    @gossip = Gossip.find(params[:id])
    gossip_params = params.require(:gossip).permit(:title, :content)
    if @gossip.update(gossip_params)