app/controllers/sessions_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."name" = $1 LIMIT $2  [["name", "moi"], ["LIMIT", 1]]
---
  def create
    user = Author.find_by(name: params[:username])