app/controllers/signs_controller.rb

INSERT INTO "authors" ("name", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "toto"], ["created_at", "2019-10-31 12:58:09.806331"], ["updated_at", "2019-10-31 12:58:09.806331"], ["password_digest", "$2a$12$8n4xDINJYEe2o/lfh.cc/emkI6oj6Esdd940HromKU.FGQ2/4DH0a"]]
---
  def create
    a = Author.new(name: params[:username], password: params[:mdp])

  if a.save && a.authenticate(params[:mdp])